<!doctype html>
<html>
<head>
    <!-- Тег <meta> - определяет метатеги, которые используются для хранения информации предназначенной для браузеров и поисковых систем. Например, механизмы поисковых систем обращаются к метатегам для получения описания сайта, ключевых слов и других данных. Разрешается использовать более чем один метатег, все они размещаются в контейнере <head>. Как правило, атрибуты любого метатега сводятся к парам «имя=значение», которые определяются ключевыми словами content, name или http-equiv.
	Атрибут http-equiv - предназначен для конвертирования метатега в заголовок HTTP.
	Занчение "Content-Type" - тип кодировки документа.
	Атрибут content - устанавливает значение атрибута, заданного с помощью name или http-equiv. -->
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
	<title>Склад. Оборотная ведомость</title>
</head>
<body>

<p><b>Склад. Оборотная ведомость</b></p>

<a href="index.php">Вернуться на склад</a>

<br />

<hr />

</body>
</html>