<!doctype html>
<html>
<head>
  <title>Комплекс опроса сетевых принтеров по протоколу SNMP</title>
  
    <!-- Основной файл стилей -->
  <link rel="stylesheet" href="css/main.css" type="text/css"/>
  
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />	 
</head>

<body>

<?php
// Выключение протоколирования ошибок
error_reporting(0);

snmp_set_quick_print(1);	// устанавливает значение quick_print в UCD SNMP-библиотеке

$ip_array = array(
'192.168.213.164',
'192.168.213.17',
'192.168.213.184',
'192.168.213.20',
'192.168.213.21',
'192.168.213.22',
'192.168.213.23',
'192.168.213.24',
'192.168.213.242',
'192.168.213.243',
'192.168.213.246',
'192.168.213.247',
'192.168.213.250',
'192.168.213.251',
'192.168.213.253',
'192.168.213.26',
'192.168.213.27',
'192.168.213.29',
'192.168.213.32',
'192.168.213.40',
'192.168.213.41',
'192.168.213.42',
'192.168.213.44',
'192.168.213.45',
'192.168.213.46',
'192.168.213.59',
'192.168.213.60',
'192.168.213.61',
'192.168.213.62',
'192.168.213.63',
'192.168.213.67',
'192.168.213.89',
'192.168.214.19',
'192.168.214.20',
'192.168.214.21',
'192.168.214.22',
'192.168.214.23',
'192.168.214.24',
'192.168.214.243',
'192.168.214.25',
'192.168.214.26',
'192.168.214.28',
'192.168.214.29',
'192.168.214.36',
'192.168.214.41',
'192.168.214.45');

$ip_array1 = array('192.168.214.41','192.168.214.41');

   echo 
    "<table> 
       <tr>  
		 <th><b>ip</b></th>	   
         <th><b>Модель принтера</b></th>
         <th><b>Серийный номер принтера</b></th>
         <th><b>Количество напечатанных страниц</b></th>
		 <th><b>Имя хоста</b></th>
		 <th><b>Номер форматера</b></th>
		 <th><b>Модель картриджа</b></th>
      </tr>";
	     
  foreach ($ip_array1 as $ip) 
  {
    // модель принтера
	$hrDeviceDescr = snmpget($ip, 'public', 'HOST-RESOURCES-MIB::hrDeviceDescr.1');	 // 1.3.6.1.2.1.25.3.2.1.3.1
	
	// серийный номер принтера
	$prtGeneralSerialNumber = snmpget($ip, 'public', 'SNMPv2-SMI::mib-2.43.5.1.1.17.1');	 // 1.3.6.1.2.1.43.5.1.1.17.1
	
	// количество напечатанных страниц: 
	$prtMarkerLifeCount = snmpget($ip, 'public', 'SNMPv2-SMI::mib-2.43.10.2.1.4.1.1');	// 1.3.6.1.2.1.43.10.2.1.4.1.1
	
    // имя хоста: 
	$sysName = snmpget($ip, 'public', 'SNMPv2-MIB::sysName.0');	// 1.3.6.1.2.1.1.5.0 
	
    // номер форматера: 
	$sysDescr = snmpget($ip, 'public', 'SNMPv2-MIB::sysDescr.0');	// 1.3.6.1.2.1.1.1.0
	
	// модель картриджа
	$prtMarkerSuppliesDescription = snmpget($ip, 'public', 'SNMPv2-SMI::mib-2.43.11.1.1.6.1.1'); // 1.3.6.1.2.1.43.11.1.1.6.1.1
	
	echo
	  "<tr>
	     <td>" . $ip . "</td>
         <td>" . $hrDeviceDescr . "</td>                            
         <td>" . $prtGeneralSerialNumber . "</td>
	     <td>" . $prtMarkerLifeCount . "</td>
		 <td>" . $sysName . "</td>
		 <td>" . $sysDescr . "</td>
		 <td>" . $prtMarkerSuppliesDescription . "</td>
	  </tr>";
  }
?>

</body>

</html>
